const abhangs = [
  { numbers: "भजन", texts: "जय जय राम कृष्ण हरी |" },
  {
    numbers: "अभंग",
    texts:
      "सुंदर ते ध्यान उभे विटेवरी । <br>कर कटावरी ठेवूनियां ॥१॥<br>तुळसी हार गळां कासे पीतांबर ।<br>आवडे निरंतर हेंचि ध्यान ॥ध्रु.॥<br>मकरकुंडले तळपती श्रवणी ।<br>कंठी कौस्तुभमणि विराजित ॥२॥ <br>तुका म्हणे माझे हेचि सर्व सुख ।<br>पाहीन श्रीमुख आवडीनें ॥३॥",
  },
  {
    numbers: "अभंग १",
    texts:
      "देवाचिये द्वारी उभा क्षणभरी । <br>तेणे मुक्ती चारी साधियेल्या ॥ १ ॥ <br>हरि मुखे म्हणा हरि मुखे म्हणा । <br>पुण्याची गणना कोण करी ॥ २ ॥<br>असोनि संसारी जिव्हे वेगु करी ।<br>वेदशास्त्र उभारी बाह्य सदा ॥ ३ ॥<br>ज्ञानदेव म्हणे व्यासाचिये खुणे ।<br>द्वारकेचा राणा पांडवा घरी ॥ ४ ॥<br>",
  },
  {
    numbers: "अभंग २",
    texts:
      "चहू वेदी जाण साही शास्त्री कारण । <br>अठराही पुराणे हरिसी गाती ॥ १ ॥<br>मंथुनी नवनीता तैसे घे अनंता ।<br>वाया व्यर्थ कथा सांडी मार्ग ॥ २ ॥<br>एक हरि आत्मा जीवशिवसमा ।<br>वाया तू दुर्गमा न घाली मन ॥ ३ ॥<br>ज्ञानदेवा पाठ हरि हा वैकुंठ ।<br>भरला घनदाट हरि दिसे ॥ ४ ॥",
  },
  {
    numbers: "अभंग ३",
    texts : 
        "त्रिगुण असार निर्गुण हे सार ।<br>सारासार विचार हरिपाठ ॥ १ ॥<br>सगुण निर्गुण गुणाचे अगुण ।<br>हरिविण मन व्यर्थ जाय ॥ २ ॥<br>अव्यक्‍त निराकार नाही ज्या आकार ।<br>जेथुनि चराचर हरिसी भजे ॥ ३ ॥<br>ज्ञानदेवा ध्यानी रामकृष्ण मनी ।<br>अनंत जन्मानी पुण्य होय ॥ ४ ॥"
  },
  {
    numbers: "अभंग ४",
    texts : 
        "भावेविण भक्‍ति भक्‍तिविण मुक्‍ति ।<br>बळेविण शक्‍ति बोलू नये ॥ १ ॥<br>कैसेनि दैवत प्रसन्न त्वरीत ।<br>उगा राहे निवांत शिणसी वाया ॥ २ ॥<br>सायासे करिसी प्रपंच दिननिशी ।<br>हरिसी न भजसी कोण्या गुणे ॥ ३ ॥<br>ज्ञानदेव म्हणे हरिजप करणे ।<br>तुटेल धरणे प्रपंचाचे ॥ ४ ॥"
  },
  {
    numbers: "अभंग ५",
    texts : 
        "योगयागविधी येणे नोहे सिद्धी ।<br>वायाची उपाधी दंभ धर्म ॥ १ ॥<br>भावेविण देव न कळे नि:संदेह ।<br>गुरुविण अनुभव कैसा कळे ॥ २ ॥<br>तपेविण दैवत दिधल्याविण प्राप्त ।<br>गुजेविण हित कोण सांगे ॥ ३ ॥<br>ज्ञानदेव सांगे दृष्टांताची मात ।<br>साधूचे संगती तरणोपाय ॥ ४ ॥"
  },
  {
    numbers: "अभंग ६",
    texts : 
        "साधुबोध झाला नुरोनिया ठेला ।<br>ठायीच मुराला अनुभवे ॥ १ ॥<br>कापुराची वाती उजळली ज्योति ।<br>ठायीच समाप्ती झाली जैसी ॥ २ ॥<br>मोक्षरेखे आला भाग्ये विनटला ।<br>साधूंचा अंकिला हरिभक्‍त ॥ ३ ॥<br>ज्ञानदेवा गोडी संगती सज्जनी ।<br>हरि दिसे जनी वनी आत्मतत्त्वी ॥ ४ ॥"
  },
  {
    numbers: "अभंग ७",
    texts : 
        "पर्वताप्रमाणे पातक करणे ।<br>        वज्रलेप होणे अभक्‍तांसी ॥ १ ॥<br>नाही ज्यासी भक्‍ति ते पतित अभक्‍त ।<br>हरिसी न भजत दैवहत ॥ २ ॥<br>अनंत वाचाळ बरळती बरळ ।<br>त्या कैसा दयाळ पावेल हरि ॥ ३ ॥<br>ज्ञानदेवा प्रमाण आत्मा हा निधान ।<br>सर्वाघटी पुर्ण एक नांदे ॥ ४ ॥"
  },
  {
    numbers: "अभंग ८",
    texts : 
        "संतांचे संगती मनोमार्ग गती ।<br>आकळावा श्रीपती येणे पंथे ॥ १ ॥<br>रामकृष्ण वाचा भाव हा जीवाचा ।<br>आत्मा जो शिवाचा रामजप ॥ २ ॥<br>एकतत्त्व नाम साधिती साधन ।<br>द्वैताचे बंधन न बाधिजे ॥ ३ ॥<br>नामामृत गोडी वैष्णवा लाधली ।<br>योगिया साधली जीवनकळा ॥ ४ ॥<br>सत्वर उच्चार प्रल्हादी बिंबला ।<br>उद्धवा लाधला कृष्ण दाता ॥ ५ ॥<br>ज्ञानदेव म्हणे नाम हे सुलभ ।<br>सर्वत्र दुर्लभ विरळा जाणे ॥ ६ ॥"
  },
  {
    numbers: "अभंग ९",
    texts : 
        "विष्णुविण जप व्यर्थ त्याचे ज्ञान ।<br>रामकृष्णी मन नाही ज्याचे ॥ १ ॥<br>उपजोनि करंटा नेणे अद्वैत वाटा ।<br>रामकृष्णी पैठा कैसेनि होय ॥ २ ॥<br>द्वैताची झाडणी गुरुविण ज्ञान ।<br>तया कैसे कीर्तन घडे नामी ॥ ३ ॥<br>ज्ञानदेव म्हणे सगुण हे ध्यान ।<br>नामपाठे मौन प्रपंचाचे ॥ ४ ॥"
  },
  {
    numbers: "भजन",
    texts :  "राम कृष्ण हरी | जय जय राम कृष्ण हरी "
  },
  {
    numbers: "अभंग १०",
    texts : 
        "त्रिवेणी संगमी नाना तीर्थे भ्रमी ।<br>चित्त नाही नामी तरी ते व्यर्थ ॥ १ ॥<br>नामासी विन्मुख तो नर पापीया ।<br>हरिविण धावया न पावे कोणी ॥ २ ॥<br>पुराणप्रसिद्ध बोलिले वाल्मिक ।<br>नामे तिन्ही लोक उद्धरती ॥ ३ ॥<br>ज्ञानदेव म्हणे नाम जपा हरिचे ।<br>परंपरा त्याचे कुळ शुद्ध ॥ ४ ॥"
  },
  {
    numbers: "अभंग ११",
    texts : 
        "हरिउच्चारणी अनंत पापराशी ।<br>जातील लयासी क्षणमात्रे ॥ १ ॥<br>तृण अग्निमेळे समरस झाले ।<br>तैसे नामे केले जपता हरि ॥ २ ॥<br>हरिउच्चारण मंत्र हा अगाध ।<br>पळे भूतबाधा भेणे याचे ॥ ३ ॥<br>ज्ञानदेव म्हणे हरि माझा समर्थ ।<br>न करवे अर्थ उपनिषदा ॥ ४ ॥"
  },
  {
    numbers: "अभंग १२",
    texts : 
        "तीर्थ व्रत नेम भावेविण सिद्धी ।<br>वायाची उपाधी करिसी जना ॥ १ ॥<br>भावबळे आकळे एरव्ही नाकळे ।<br>करतळी आवळे जैसा हरि ॥ २ ॥<br>पारियाचा रवा घेता भूमीवरी ।<br>यत्‍न परोपरी साधन तैसे ॥ ३ ॥<br>ज्ञानदेव म्हणे निवृत्ती निर्गुण ।<br>दिधले संपूर्ण माझे हाती ॥ ४ ॥"
  },
  {
    numbers: "अभंग १३",
    texts : 
        "समाधी हरिची समसुखेविण ।<br>न साधेल जाण द्वैतबुद्धी ॥ १ ॥<br>बुद्धीचे वैभव अन्य नाही दुजे ।<br>एका केशवराजे सकळ सिद्धी ॥ २ ॥<br>ऋद्धी सिद्धी निधी अवघीच उपाधी ।<br>जव त्या परमानंदी मन नाही ॥ ३ ॥<br>ज्ञानदेवी रम्य रमले समाधान ।<br>हरिचे चिंतन सर्वकाळ ॥ ४ ॥"
  },
  {
    numbers: "अभंग १४",
    texts : 
        "नित्य सत्यामित हरिपाठ ज्यासी ।<br>कळिकाळी त्यासी न पाहे दृष्टी ॥ १ ॥<br>रामकृष्ण उच्चार अनंतराशी तप ।<br>पापाचे कळप पळती पुढे ॥ २ ॥<br>हरि हरि हरि मंत्र हा शिवाचा ।<br>म्हणती जे वाचा तया मोक्ष ॥ ३ ॥<br>ज्ञानदेवा पाठ नारायण नाम ।<br>पाविजे उत्तम निजस्थान ॥ ४ ॥"
  },
  {
    numbers: "अभंग १५",
    texts : 
        "एक नाम हरि द्वैत नाम दुरी ।<br>अद्वैत कुसरी विरळा जाणे ॥ १ ॥<br>समबुद्धी घेता समान श्रीहरि ।<br>शमदमा वरी हरि झाला ॥ २ ॥<br>सर्वाघटी राम देहादेही एक ।<br>सूर्यप्रकाशक सहस्त्ररश्मी ॥ ३ ॥<br>ज्ञानदेवा चित्ती हरिपाठ नेमा ।<br>मागिलिया जन्मा मुक्‍त झालो ॥ ४ ॥"
  },
  {
    numbers: "अभंग १६",
    texts : 
        "हरिनाम जपे तो नर दुर्लभ ।<br>वाचेसी सुलभ रामकृष्ण ॥ १ ॥<br>रामकृष्ण नामी उन्मनी साधिली ।<br>तयासी लाधली सकळ सिद्धी ॥ २ ॥<br>सिद्धी बुद्धी धर्म हरिपाठी आले ।<br>प्रपंची निवाले साधुसंगे ॥ ३ ॥<br>ज्ञानदेवी नाम रामकृष्ण ठसा ।<br>येणे दशदिशा आत्माराम ॥ ४ ॥"
  },
  {
    numbers: "अभंग १७",
    texts : 
        "हरिपाठ कीर्ति मुखे जरी गाय ।<br>पवित्रचि होय देह त्याचा ॥ १ ॥<br>तपाचे सामर्थ्य तपिन्नला अमूप ।<br>चिरंजीव कल्प वैकुंठी नांदे ॥ २ ॥<br>मातृ पितृ भ्राता सगोत्र अपार ।<br>चतुर्भुज नर होऊनी ठेले ॥ ३ ॥<br>ज्ञानगूढ गम्य ज्ञानदेवा लाधले ।<br>निवृत्तीने दिधले माझे हाती ॥ ४ ॥"
  },
  {
    numbers: "अभंग १८",
    texts : 
        "हरिवंश पुराण हरिनाम संकीर्तन ।<br>हरिविण सौजन्य नेणे काही ॥ १ ॥<br>तया नरा लाधले वैकुंठ जोडले ।<br>सकळही घडले तीर्थाटन ॥ २ ॥<br>मनोमार्गे गेला तो तेथे मुकला ।<br>हरिपाठी स्थिरावला तोचि धन्य ॥ ३ ॥<br>ज्ञानदेवा गोडी हरिनामाची जोडी ।<br>रामकृष्णी आवडी सर्वकाळ ॥ ४ ॥"
  },
  {
    numbers: "भजन",
    texts : "विठोबा राखुमाई | जय जय विठोबा राखुमाई ||"
  },
  {
    numbers: "अभंग १९",
    texts : 
        "नामसंकीर्तन वैष्णवांची जोडी ।<br>पापे अनंत कोटी गेली त्यांची ॥ १ ॥<br>अनंत जन्मांचे तप एक नाम ।<br>सर्व मार्ग सुगम हरिपाठ ॥ २ ॥<br>योग याग क्रिया धर्माधर्म माया ।<br>गेले ते विलया हरिपाठी ॥ ३ ॥<br>ज्ञानदेवी यज्ञ याग क्रिया धर्म ।<br>हरिविण नेम नाही दुजा ॥ ४ ॥"
  },
  {
    numbers: "अभंग २०",
    texts : 
        "वेद शास्त्र पुराण श्रुतीचे वचन ।<br>एक नारायण सार जप ॥ १ ॥<br>जप तप कर्म हरिविण धर्म ।<br>वाउगाचि श्रम व्यर्थ जाय ॥ २ ॥<br>हरिपाठी गेले ते निवांतचि ठेले ।<br>भ्रमर गुंतले सुमन कळिके ॥ ३ ॥<br>ज्ञानदेवी मंत्र हरिनामाचे शस्त्र ।<br>यमे कुळगोत्र वर्जियेले ॥ ४ ॥"
  },
  {
    numbers: "अभंग २१",
    texts : 
        "काळ वेळ नाम उच्चारिता नाही ।<br>दोन्ही पक्ष पाही उद्धरती ॥ १ ॥<br>रामकृष्ण नाम सर्व दोषा हरण ।<br>जडजीवा तारण हरि एक ॥ २ ॥<br>नाम हरि सार जिव्हा या नामाची ।<br>उपमा त्या दैवाची कोण वानी ॥ ३ ॥<br>ज्ञानदेवा सांग झाला हरिपाठ ।<br>पुर्वजा वैकुंठ मार्ग सोपा ॥ ४ ॥"
  },
  {
    numbers: "अभंग २२",
    texts : 
        "नित्यनेमनामी ते प्राणी दुर्लभ ।<br>लक्ष्मीवल्लभ तया जवळी ॥ १ ॥<br>नारायण हरि नारायण हरि ।<br>भक्‍ति मुक्‍ति चारी घरी त्यांच्या ॥ २ ॥<br>हरिविण जन्म तो नर्कचि पै जाणा ।<br>यमाचा पाहुणा प्राणी होय ॥ ३ ॥<br>ज्ञानदेव पुसे निवृत्तीसी चाड ।<br>गगनाहूनि वाड नाम आहे ॥ ४ ॥"
  },
  {
    numbers: "अभंग २३",
    texts : 
        "सात पाच तीन दशकांचा मेळा ।<br>एकतत्त्वी कळा दावी हरि ॥ १ ॥<br>तैसे नव्हे नाम सर्व मार्गा वरिष्ठ ।<br>येथे काही कष्ट न लागती ॥ २ ॥<br>अजपा जपणे उलट प्राणाचा ।<br>तेथेही मनाचा निर्धारु असे ॥ ३ ॥<br>ज्ञानदेवा जिणे नामेविण व्यर्थ ।<br>रामकृष्णी पंथ क्रमीयेला ॥ ४ ॥"
  },
  {
    numbers: "अभंग २४",
    texts : 
        "जप तप कर्म क्रिया नेम धर्म ।<br>सर्वाघटी राम भाव शुद्ध ॥ १ ॥<br>न सोडी हा भावो टाकी रे संदेहो ।<br>रामकृष्णी टाहो नित्य फोडी ॥ २ ॥<br>जात वित्त गोत कुळ शीळ मात ।<br>भजे का त्वरित भावनायुक्‍त ॥ ३ ॥<br>ज्ञानदेवा ध्यानी रामकृष्ण मनी ।<br>वैकुंठ भुवनी घर केले ॥ ४ ॥"
  },
  {
    numbers: "अभंग २५",
    texts : 
        "जाणीव नेणीव भगवंती नाही ।<br>हरि उच्चारणी पाही मोक्ष सदा ॥ १ ॥<br>नारायण हरि उच्चार नामाचा ।<br>तेथे कळिकाळाचा रीघ नाही ॥ २ ॥<br>तेथील प्रमाण नेणवे वेदांसी ।<br>ते जीव जंतूसी केवि कळे ॥ ३ ॥<br>ज्ञानदेवा फळ नारायण पाठ ।<br>सर्वत्र वैकुंठ केले असे ॥ ४ ॥"
  },
  {
    numbers: "अभंग २६",
    texts : 
        "एक तत्त्व नाम दृढ धरी मना ।<br>हरिसी करुणा येईल तूझी ॥ १ ॥<br>ते नाम सोपे रे रामकृष्ण गोविंद ।<br>वाचेसी सद्‍गद्‍ जपे आधी ॥ २ ॥<br>नामापरते तत्त्व नाही रे अन्यथा ।<br>वाया आणिका पंथा जाशी झणी ॥ ३ ॥<br>ज्ञानदेवा मौन जपमाळ अंतरी ।<br>धरोनी श्रीहरि जपे सदा ॥ ४ ॥"
  },
  {
    numbers: "अभंग २७",
    texts : 
        "सर्व सुख गोडी सर्व शास्त्रे निवडी ।<br>रिकामा अर्धघडी राहू नको ॥ १ ॥<br>लटिका व्यवहार सर्व हा संसार ।<br>वाया येरझार हरिविण ॥ २ ॥<br>नाममंत्र जप कोटी जाईल पाप ।<br>रामकृष्णी संकल्प धरूनी राहे ॥ ३ ॥<br>निजवृत्ति काढी सर्व माया तोडी ।<br>इंद्रियांसवडी लपू नको ॥ ४ ॥<br>तीर्थ व्रती भाव धरी रे करुणा ।<br>शांति दया पाहुणा हरि करी ॥ ५ ॥<br>ज्ञानदेवा प्रमाण निवृत्तीदेवी ज्ञान ।<br>समाधि संजीवन हरिपाठ ॥ ६ ॥"
  }, 
  {
    numbers: "अभंग",
    texts : 
        "नाम संकीर्तन साधन पै सोपे ।<br> जळतील पापे जन्मांतरीची ।<br>न लगे सायास जावे वनातरा ।<br> सुखी येती घरा नारायणा ॥धृ॥<br>ठाईच बैसोनी करा एक चित्त ।<br> आवडी अनंत आळवावा ॥१॥<br>रामकृष्ण हरी विठ्ठल केशवा ।<br> मंत्र हा जपावा सर्व काळ ॥२॥<br>तुका म्हणे सोपे आहे सर्वाहूनी ।<br>  शहाणा तो धनी येतो तेथे ॥३॥"
  },
  {
    numbers: "अभंग",
    texts:
      "देवाचिये द्वारी उभा क्षणभरी । <br>तेणे मुक्ती चारी साधियेल्या ॥ १ ॥ <br>हरि मुखे म्हणा हरि मुखे म्हणा । <br>पुण्याची गणना कोण करी ॥ २ ॥<br>असोनि संसारी जिव्हे वेगु करी ।<br>वेदशास्त्र उभारी बाह्य सदा ॥ ३ ॥<br>ज्ञानदेव म्हणे व्यासाचिये खुणे ।<br>द्वारकेचा राणा पांडवा घरी ॥ ४ ॥<br>",
  },
  {
    numbers: "भजन",
    texts : "ज्ञानोबा माऊली तुकाराम ||"
  }, 
  {
    numbers: "अभंग १",
    texts:
      "सत्य गुरुरायें कृपा मज केली |<br>परि नाहीं घडलीं सेवा कांहीं ||1||<br>सांपडविलें वाटे जातां गंगास्नाना |<br>मस्तकीं तो जाणा ठेविला कर ||2||<br>भोजना मागती तूप पावशेर |<br>पडिला विसर स्वप्नामाजी ||3||<br>काय न कळे उपजला अंतराय |<br>म्हणोनियां काय त्वरा झाली ||4||<br>राघव चैतल्य , केशव चैतन्य |<br>सांगितली खूण मालिकेची ||5||<br>बाबाजी आपुले सांगितलें नाम |<br>मंत्र दिला रामकृष्ण हरि ||6||<br>माघ शुद्ध दशमी पाहुनि गुरुवार |<br>केला अंगीकार तुका म्हणे ||7||",
  },
  {
    numbers: "अभंग २",
    texts:
      "माझीये मनीचा जाणूनिया भाव ।<br> तो करी उपाव गुरुरावो ।। १ ।।<br>आवडीचा मंत्र सांगितला सोपा ।<br> जेणे नोहे गुंफा कोठे काही ।। २ ।।<br>जातीपुढे एक उतरले पार ।<br> हा भवसागर साधुसंत ।। ३ ।।<br>जाणत्या नेणत्या ज्या जैसी आवडी ।<br> उतार सांगडी तापे पेठे ।। ४ ।।<br>तुका म्हणे संती दावियेला तारू ।<br> कृपेचा सागरू पांडुरंग ।। ५ ।।",
  },
  {
    numbers: "अभंग ३",
    texts:
      "घालूनिया भार राहिलो निश्चिंती ।<br> निरविले संती विठोबाशी ।। १ ।।<br>लाऊनिया हात कुरुवाळीला माथा ।<br> सांगितले चिंता न करावी ।। २ ।।<br>कटी कर सम चरण साजिरे ।<br> राहिला भिवरे तिरी उभा ।। ३ ।।<br>खुंटले सायास आणिक या जीवा ।<br> धरिले केशवा पाय तुझे।।४।।<br>तुज वाटे आता ते करी अनंता ।<br> तुका म्हणे संता लाज माझी ।।५।।",
  },
  {
    numbers: "अभंग ४",
    texts:
      "माझ्या विठोबाचा कैसा प्रेमभाव ।<br> आपणचि देव होय गुरु ।। १ ।।<br>पढिये देहभाव पुरवी वासना ।<br> अंती ते आपणापासी न्यावे ।। २ ।।<br>मागे पुढे उभा राहे सांभाळीत ।<br> आलिया आघात निवाराया ।। ३ ।।<br>योगक्षेम त्यांचा जाणे जडभारी ।<br> वाट दावी कर धरोनिया ।।४।।<br>तुका म्हणे नाही विश्वास ज्या मनी ।<br> पहावे पुराणी विचारूणी ।।५।।",
  },
  {
    numbers: "अभंग ५",
    texts:
      "मुख्य महाविष्णु चैतन्याचें मूळ ।<br> सांप्रदाय फळ तथोनियां ॥१॥<br>हंसरुपी ब्रम्हा उपदेशी श्रीहरी ।<br> चतुश्लोकी चारी भागवत ॥२॥<br>तें गुज विधाता सांगे नारदासी ।<br> नारदें व्यासासी उपदेशिलें ॥३॥<br>राघव चैतन्य केलें अनुष्ठान ।<br> त्यासी व्दैपायनें कृपा केली ॥४॥<br>कृपा करुनि हस्त ठेवियेला शिरीं ।<br> बोध तो अंतरी ठसावला ॥५॥<br>राघवा चरणीं केशव शरण ।<br> बाबाजीशीं पूर्ण कृपा त्याची ॥६॥<br>बाबाजीनें स्वप्नीं येऊनि तुक्याला ।<br> अनुग्रह दिला निज प्रीति ॥७॥<br>जगदगुरु तुका अवतार नामयाचा ।<br> संप्रदाय सकळांचा येथुनियां ॥८॥<br>निळा म्हणे मज उपदेश केला ।<br> संप्रदाय दिला सकळ जना ॥९॥",
  },
  {
    numbers: "अभंग ६",
    texts:
      "आदिनाथ उमा बीज प्रगटले ।<br> मच्छिंद्रा लाधले सहजस्थिति ।। १ ।।<br>तेची प्रेममुद्रा गोरक्षा दिधली ।<br> पूर्ण कृपा केली गहिणींनाथा ।। २ ।।<br>वैराग्ये तापला सप्रेमे निमाला ।<br> ठेंवा जो लाधला शांती सुख ।। ३ ।।<br>निर्द्वंद्व निसंक विचारता मही ।<br> सुखानंद र्‍हदयि स्थिरावला ।। ४ ।।<br>विरक्तीचे पात्र अन्वयाचे मुख ।<br> येउनि सम्यक अनन्यता ।। ५ ।।<br>निवृत्ती गहिनी कृपा केली पूर्ण ।<br> कुळ हे पावन कृष्ण नामे ।। ६ ।।",
  },
  {
    numbers: "अभंग ७",
    texts:
      "आदिनाथ गुरु सकळ सिद्धांचा ।<br> मच्छिंद्र तयाचा मुख्य शिष्य ।। १ ।।<br>मच्छिंद्राने बोध गोरक्षाशी केला ।<br> गोरक्ष ओळला गहिणीप्रति ।। २ ।।<br>गहिनी प्रसादे निवृत्ती दातार ।<br> ज्ञानदेवा सार चोजविले ।। ३ ।।",
  },
  {
    numbers: "अभंग ८",
    texts:
      "अवघेचि त्र्येलोक्य आनंदाचे आता ।<br> चरणी जगन्नाथा चित्त ठेले ।। १ ।।<br>माय जगन्नाथ बाप जगन्नाथ ।<br> अनाथाचा नाथ जनार्दन ।। २ ।।<br>एका जनार्दनी एकपणे उभा ।<br> चैतन्याची शोभा शोभतसे ।। ३ ।।",
  },
  {
    numbers: "अभंग ९",
    texts:
      "अवघाचि-संसार सुखाचा-करीन ।<br> आनंदे-भरीन तिन्ही-लोक ।।१।।<br>जाईन गे माये तया पंढरपुरा ।<br> भेटेन माहेरा आपुलिया ।।२।।<br>सर्व सुकृताचे फळ नि लाहीन ।<br> क्षेम मी देईन पांडुरंग ।।३।।<br>बाप रखुमादेवीवरु विट्ठलाची भेटी ।<br> आपुल्या सेवेसाठी करुनि ठेला ।।४।।",
  },
  {
    numbers: "अभंग १०",
    texts:
      "श्रीगुरुसारिखा असतां पाठीराखा ।<br>इतरांचा लेखा कोण करी ॥१॥<br>राजयाची कांता काय भीक मागे ।<br>मनाचिया जोगे सिध्दि पावे ॥२॥<br>कल्पतरुतळवटीं जो कोणी बैसला ।<br>काय वाणी त्याला सांगिजोजी ॥३॥<br>ज्ञानदेव म्हणे तरलों तरलों ।<br>आतां उध्दरलों गुरुकृपें ॥४॥",
  },
  {
    numbers: "अभंग ११",
    texts:
      "इवलेसे रोप लवियेलें द्वारी ।<br>त्याचा वेलू गेला गगणावरी ।।१।।<br>मोगरा फुलला  मोगरा फुलला ।<br>फुले वेचिताती भारू कळीयासी आला ।।धृ।।<br>मनाचीये गुंती गुंफियेला शेला ।<br>बापरखुमादेवीवरू विठ्ठली अर्पिला ।।२।।",
  },
  {
    numbers: "भजन",
    texts : "ज्ञानेश्वर माऊली | ज्ञानराज माऊली तुकाराम ||"
  }, 
  {
    numbers: "गणपती आरती",
    texts : "सुखकर्ता दुखहर्ता वार्ता विघ्नाची ।<br>नुरवी पूर्वी प्रेम कृपा जयाची ।<br>सर्वांगी सुंदर उटी शेंदुराची ।<br>कंठी झळके माळ मुक्ताफळाची ॥०१॥<br>जय देव जय देव जय मंगलमूर्ती ।<br>दर्शनमात्रे मनकामना पुरती ।<br>रत्नखचित फरा तूज गौरीकुमरा ।<br>चंदनाची उटी कुंकुमकेशरा ।<br>हिरे जडित मुकुट शोभतो बरा ।<br>रुणझुणती नुपुरे चरणी घागरिया ॥०२॥<br>लंबोदर पितांबर फनी वरवंदना ।<br>सरळ सोंड वक्रतुंड त्रिनयना ।<br>दास रामाचा वाट पाहे सदना ।<br>संकटी पावावे निर्वाणी रक्षावे सुरवंदना ।<br>जय देव जय देव जय मंगलमूर्ती ।<br>दर्शनमात्रे मनकामना पुरती ॥०३॥"
  }, 
  {
    numbers: "ज्ञानेश्वर माऊली आरती",
    texts : "आरती ज्ञानराजा | महाकैवल्यतेजा |<br> सेविती साधुसंत | मनु वेधला माझा ||धृ०||<br>लोपलें ज्ञान जगीं | हित नेणती कोणी |<br> अवतार पांडुरंग |नाम ठेविलें ज्ञानी || १ ||<br>प्रगट गुह्य बोले | विश्व ब्रह्याचे केलें |<br> रामा जनार्दनी |पायीं मस्तक ठेविलें || ३ ||"
  },
  {
    numbers: "तुकाराम महाराज आरती",
    texts : "आरती तुकारामा | स्वामी  सद्गुरुधामा |<br>सच्चिदानंद मूर्ती | पायी दाखवीं आम्हां || धृ ||<br><br>राघवें सागरांत | जैसे पाषाण तारिले |<br>तैसे हे तुकोबाचे | अभंग रक्षिले || १ ||<br><br>तुकितां तुलनेसी | ब्रम्ह तुकासी आलें |<br>म्हणोनी रामेश्वरें | चरणी मस्तक ठेविलें ||२ || "
  },
  {
    numbers: "प्रार्थना",
    texts : "घालीन लोटांगण वंदीन चरण।।<br>डोळ्यांनी पाहीन रूप तुझें।।<br>प्रेमें आलिंगन आनंदे पूजिन।।<br>भावें ओवाळीन म्हणे नामा।।<br><br>त्वमेव माता च पिता त्वमेव।।<br>त्वमेव बंधुश्‍च सखा त्वमेव।।<br>त्वमेव विद्या द्रविणं त्वमेव।।<br>त्वमेव सर्वं मम देवदेव।।<br><br>कायेन वाचा मनसेंद्रियैर्वा।।<br>बुद्धात्मना व प्रकृतिस्वभावअत्‌।।<br>करोमि यद्‌त्सकलं परस्मै।।<br>नारायणायेति समर्पयामि।<br><br>अच्युतं केशवं रामनारायणं।।<br>कृष्णदामोदरं वासुदेवं हरिम्‌।।<br>श्रीधरं माधवं गोपिकावल्लभं।।<br>जानकीनायकं रामचंद्रं भजे।। <br><br>हरे राम हरे राम राम राम हरे हरे।।<br>हरे कृष्ण हरे कृष्ण कृष्ण कृष्ण हरे हरे।। "
  },
  {
    numbers: "भजन",
    texts : "ज्ञानेश्वर माऊली | ज्ञानराज माऊली तुकाराम ||"
  },
  {
    numbers: "मागणी अभंग ",
    texts:
      "हेची व्हावी माझी आस।<br> जन्मोजन्मी तुझा दास ।।१।।<br> पंढरीचा वारकरी ।<br>वारी चुको नेदी हरी ।।२।।<br> संत संग सर्वकाळ।<br> अखंड प्रेमाचा कल्लोळ ।।३।।<br> चंद्रभागे स्नान।<br> तुका मागे हेचि दान ।।४।।",
  }, 
  {
    numbers: "मागणी अभंग ",
    texts:
      "आकल्प आयुष्य व्हावे तया कुळा ।<br> माझिया सकळा हरीच्या दासा ॥१॥<br>कल्पनेची बाधा न हो कवणें काळीं ।<br> ही संतमंडळी सुखीं असो ॥२॥<br>अहंकाराचा वारा न लागो राजसा ।<br> माझिया विष्णुदासा भाविकांसी ॥३॥<br>नाम म्हणे तया असावें कल्याण ।<br> ज्या मुखीं निधान पांडुरंग ॥४॥",
  }, 
  {
    numbers: "मागणी अभंग ",
    texts:
      "मागणे ते एक तुजप्रती आहे।<br>देशील तरी पाहे पांडुरंगा॥<br>या संतासी निरवी हेचि मज देई।<br>आणिक दुजे काही न मागे देवा॥<br>तुका म्हणे आता उदार तू होई।<br>मज ठेवी पायी संताचिया॥",
  }
];

const kramank = document.getElementById("kramank");
const abhanga = document.getElementById("abhanga");
const page = document.getElementById("content");

let count = 0;
kramank.innerHTML = abhangs[count].numbers;
abhanga.innerHTML = abhangs[count].texts;

function nextAbhang(status) {
  if (status == 1) {count++;}
  else {count--;}

  kramank.innerHTML = abhangs[count].numbers;
  abhanga.innerHTML = abhangs[count].texts;
  console.log(count);   
}
